NVIDIA/OpenSMA/src/sys/mcxn556/sys/i2c/i2c.cpp
/*
 * SPDX-FileCopyrightText: Copyright (c) 2026 NVIDIA CORPORATION & AFFILIATES.
 * All rights reserved.
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include "sys/i2c/i2c.h"

#include "fsl_clock.h"
#include <cstdint>
#include <cstring>

#include "nv/i2c/mutex.h"
#include "nv/i2c/task.h"
#include "nv/i2c/smb_direct.h"
#include "nv/i2c/helper.h"
#include "nv/ipc/mutex.h"
#include "nv/i2c/eeprom_cache.h"
#include "nv/logger/log.h"
#include "nv/logger/task.h"
#include "sys/i2c/utils.h"

#include "nv/nv.h"
#include "nv/ipc/supervisor.h"
#include "nv/ctimer/ctimer.h"

using namespace nv;
using namespace sys::i2c;

namespace sys::i2c {

void download_log_in_isr(const uint8_t CurrentSession, I2cBuffer& log_buffer_data)
{
    nv::logger::Dlreq       res_log{};
    const nv::logger::Dlreq req_log{.session = CurrentSession};

    auto& task = nv::ipc::Supervisor::inst().task(nv::ipc::TaskId::Logger);
    // NOLINTNEXTLINE(*-reinterpret-cast)
    auto& logger_task = reinterpret_cast<nv::logger::Task&>(task);
    logger_task.get_logger_obj().process_download(req_log, res_log);

    log_buffer_data[0] = res_log.session;
    log_buffer_data[1] = res_log.size;
    memcpy(&log_buffer_data[2], std::bit_cast<uint8_t*>(res_log.data.data()), res_log.size);
}

SlaveFunction get_slave_function(nv::i2c::Port port, uint8_t address)
{
    // Lookup in slave function table
    for (const auto& entry : nv::ipc::SlaveFunctionTable) {
        if (entry.enabled && entry.port == port && entry.address == address) {
            return entry.function;
        }
    }
    // Default: MCTP/SMBus handling
    return SlaveFunction::Mctp;
}

/// EEPROM slave callback - handles all EEPROM cache operations
void Driver::target_callback_eeprom([[maybe_unused]] LPI2C_Type* base,
                                    lpi2c_slave_transfer_t*      transfer,
                                    void*                        user_data)
{
    using namespace nv::i2c;
    auto  context = static_cast<TargetContex*>(user_data);
    auto& task    = nv::ipc::Supervisor::inst().task(nv::ipc::EepromTaskId);
    // NOLINTNEXTLINE(*-reinterpret-cast)
    auto& eeprom_task = reinterpret_cast<nv::i2c::Task&>(task);
    auto& cache       = eeprom_task.eeprom_cache();

    const std::span<uint8_t> Buffer = context->buffer;

    switch (transfer->event) {
        case kLPI2C_SlaveAddressMatchEvent:
            transfer->data     = nullptr;
            transfer->dataSize = 0;
            if (transfer->receivedAddress & 0x01U) {
                if (cache.use_2byte_addr()) {
                    const uint16_t eeprom_addr = (static_cast<uint16_t>(Buffer[2]) << 8)
                                               | Buffer[3];
                    cache.set_addr_ptr(eeprom_addr);
                }
                else {
                    cache.set_addr_ptr(Buffer[2]);
                }
            }
            break;
        case kLPI2C_SlaveTransmitEvent: {
            context->transmit = true;
            Buffer[0]         = cache.read(cache.get_addr_ptr());
            cache.inc_addr_ptr();
            transfer->data     = Buffer.subspan(0, 1).data();
            transfer->dataSize = 1;
            break;
        }
        case kLPI2C_SlaveReceiveEvent:
            context->transmit  = false;
            transfer->data     = Buffer.subspan(2).data();
            transfer->dataSize = Buffer.subspan(2).size();
            break;
        case kLPI2C_SlaveCompletionEvent:
            if (!context->transmit && transfer->transferredCount > 0) {
                const uint8_t AddrBytes = cache.use_2byte_addr() ? 2 : 1;
                if (transfer->transferredCount >= AddrBytes) {
                    uint16_t eeprom_addr = 0;
                    if (cache.use_2byte_addr()) {
                        eeprom_addr = (static_cast<uint16_t>(Buffer[2]) << 8) | Buffer[3];
                    }
                    else {
                        eeprom_addr = Buffer[2];
                    }
                    cache.set_addr_ptr(eeprom_addr);
                    for (size_t i = AddrBytes; i < transfer->transferredCount; i++) {
                        cache.write(cache.get_addr_ptr(), Buffer[2 + i]);
                        cache.inc_addr_ptr();
                    }
                }
            }
            break;
        default: break;
    }
}

void Driver::target_callback_lookup(LPI2C_Type*             base,
                                    lpi2c_slave_transfer_t* transfer,
                                    void*                   user_data)
{
    auto context = static_cast<TargetContex*>(user_data);

    // Determine slave function on address match
    if (transfer->event == kLPI2C_SlaveAddressMatchEvent) {
        const auto address  = static_cast<uint8_t>(transfer->receivedAddress & 0xFF) >> 1U;
        const auto instance = LPI2C_GetInstance(base);
        NV_ASSERT(instance < nv::common::to_underlying(nv::i2c::Port::End));
        const auto port   = static_cast<nv::i2c::Port>(instance);
        context->function = get_slave_function(port, address);
    }

    // Dispatch to appropriate slave callback
    switch (context->function) {
        case SlaveFunction::Eeprom: target_callback_eeprom(base, transfer, user_data); break;
        case SlaveFunction::Erot  : target_callback_erot(base, transfer, user_data); break;
        case SlaveFunction::Mctp  :
        default                   : target_callback(base, transfer, user_data); break;
    }
}
/// EROT slave callback - handles OCP Recovery 2-byte writes (reg, value) from
/// a downstream EROT acting as I2C master after its boot completes.
void Driver::target_callback_erot([[maybe_unused]] LPI2C_Type* base,
                                  lpi2c_slave_transfer_t*      transfer,
                                  void*                        user_data)
{
    using namespace nv::i2c;
    auto                     context = static_cast<TargetContex*>(user_data);
    auto                     task    = static_cast<Task*>(context->task);
    const std::span<uint8_t> Buffer  = context->buffer;

    switch (transfer->event) {
        case kLPI2C_SlaveAddressMatchEvent:
            transfer->data     = nullptr;
            transfer->dataSize = 0;
            break;
        case kLPI2C_SlaveReceiveEvent:
            context->transmit  = false;
            transfer->data     = Buffer.subspan(2).data();
            transfer->dataSize = Buffer.subspan(2).size();
            break;
        case kLPI2C_SlaveCompletionEvent:
            if (!context->transmit && transfer->transferredCount == 2) {
                task->handle_erot_recovery(/*reg=*/context->buffer[2],
                                           /*value=*/context->buffer[3]);
            }
            break;
        default: break;
    }
}
}  // namespace sys::i2c

LPI2C_Type* Driver::get_base(nv::i2c::Port port)
{
    constexpr uint8_t Size = nv::common::to_underlying(nv::i2c::Port::End);
    // NOLINTNEXTLINE: SDK definition
    std::array<LPI2C_Type*, Size> bases LPI2C_BASE_PTRS;
    return bases.at(nv::common::to_underlying(port));
}

