NVIDIA/OpenSMA/src/sys/mcxn556/sys/i2c/i2c.cpp
IRQn_Type Driver::get_irq(nv::i2c::Port port)
{
    constexpr uint8_t Size = nv::common::to_underlying(nv::i2c::Port::End);
    // NOLINTNEXTLINE: SDK definition
    std::array<IRQn_Type, Size> irqs LPI2C_IRQS;
    return irqs.at(nv::common::to_underlying(port));
}

void Driver::irq_handler(uint32_t instance, void* handle)
{
    NV_ASSERT(instance < nv::common::to_underlying(nv::i2c::Port::End));
    NV_ASSERT(handle != nullptr);
    auto base         = get_base(static_cast<nv::i2c::Port>(instance));
    auto lpi2c_handle = static_cast<Lpi2cHandle*>(handle);
    if ((base->MCR & LPI2C_MCR_MEN_MASK) != 0U) {
        LPI2C_MasterTransferHandleIRQ(instance, &lpi2c_handle->controller);
    }
    if ((base->SCR & LPI2C_SCR_SEN_MASK) != 0U) {
        LPI2C_SlaveTransferHandleIRQ(instance, &lpi2c_handle->target);
    }
}

void Driver::controller_callback([[maybe_unused]] LPI2C_Type*            base,
                                 [[maybe_unused]] lpi2c_master_handle_t* handle,
                                 status_t                                completion_status,
                                 void*                                   user_data)
{
    using namespace nv::i2c;
    auto context = static_cast<ControllerContex*>(user_data);
    auto task    = static_cast<Task*>(context->task);
    switch (completion_status) {
        case kStatus_Success              : task->set_event(Task::Event::CtrlDone); break;
        case kStatus_LPI2C_Nak            : task->set_event(Task::Event::CtrlNak); break;
        case kStatus_LPI2C_ArbitrationLost: task->set_event(Task::Event::CtrlArbLost); break;
        case kStatus_LPI2C_FifoError      : task->set_event(Task::Event::CtrlFifoError); break;
        case kStatus_LPI2C_BitError       : task->set_event(Task::Event::CtrlBitError); break;
        case kStatus_LPI2C_PinLowTimeout:
            task->set_event(Task::Event::CtrlPinLowTimeout);
            break;
        case kStatus_LPI2C_DmaRequestFail: task->set_event(Task::Event::CtrlDmaError); break;
        case kStatus_LPI2C_Timeout       : task->set_event(Task::Event::CtrlTimeout); break;
        case kStatus_LPI2C_NoTransferInProgress:
            task->set_event(Task::Event::CtrlNoTransfer);
            break;
        default:
            /// TODO should we enable pin low detect?
            task->set_event(Task::Event::CtrlError);
            break;
    }
}

void Driver::update_target_state_time_stamp(lpi2c_slave_transfer_event_t event)
{
    switch (event) {
        case kLPI2C_SlaveAddressMatchEvent:
        case kLPI2C_SlaveTransmitEvent:
        case kLPI2C_SlaveReceiveEvent:
            _target_state_time_stamp.store(nv::ctimer::Driver::read_ticks(),
                                           std::memory_order_relaxed);
            break;
        case kLPI2C_SlaveCompletionEvent:
            _target_state_time_stamp.store(0U, std::memory_order_relaxed);
            break;
        default: break;
    }
}

void Driver::check_target_timeout([[maybe_unused]] bool enable_target)
{
    if constexpr (nv::i2c::EnableI2cPeripheralRecovery) {
        if constexpr (nv::i2c::I2CTargetTimeoutCheckIntervalMs > 0) {
            const auto ts = _target_state_time_stamp.load(std::memory_order_relaxed);
            if (ts == 0U) {
                return;
            }
            const auto now        = nv::ctimer::Driver::read_ticks();
            const auto elapsed_us = sys::ctimer::Driver::get_counter_difference(ts, now);
            if (elapsed_us > nv::i2c::I2CTargetTimeoutUs) {
                peripheral_recovery(enable_target);
                _target_state_time_stamp.store(0U, std::memory_order_relaxed);
            }
        }
    }
}

void Driver::target_callback(LPI2C_Type*             base,
                             lpi2c_slave_transfer_t* transfer,
                             void*                   user_data)
{
    using namespace nv::i2c;
    constexpr uint8_t DefaultData   = 0xFF;
    constexpr uint8_t MinPacketSize = 4;
    auto              context       = static_cast<TargetContex*>(user_data);
    auto              task          = static_cast<Task*>(context->task);
    auto*             drv           = context->owner;
    NV_ASSERT(drv != nullptr);
    drv->update_target_state_time_stamp(transfer->event);
    const std::span<uint8_t> Buffer = context->buffer;
    switch (transfer->event) {
        case kLPI2C_SlaveAddressMatchEvent:
            transfer->data     = nullptr;
            transfer->dataSize = 0;
            break;
        case kLPI2C_SlaveTransmitEvent: {
            context->transmit  = true;
            transfer->data     = context->buffer.data();
            transfer->dataSize = context->buffer.size();

            auto status = false;
            if constexpr (nv::ipc::EnableSmbDirect) {
                status = nv::i2c::on_smbus_direct(context->buffer[2], context->buffer);
            }
            else {
                status = nv::i2c::vr_on_smbus_direct(context->buffer[2],
                                                     context->buffer,
                                                     nv::smb_telemetry::SmbDirect::get_cache());
            }

            if (!status) {
                const auto CmdCode = context->buffer[2];
                if (CmdCode == std::to_underlying(I2cCustomizeCommand::DumpLog)) {
                    const uint8_t RequestSession = context->buffer[3];
                    context->buffer.fill(0x0);
                    download_log_in_isr(RequestSession, context->buffer);
                }
                else {
                    context->buffer[2] = 0x0;
                    context->buffer[0] = DefaultData;
                }
            }
        } break;

        case kLPI2C_SlaveReceiveEvent:
            context->transmit  = false;
            transfer->data     = Buffer.subspan(2).data();
            transfer->dataSize = Buffer.subspan(2).size();
            break;
        case kLPI2C_SlaveCompletionEvent:
            if (transfer->completionStatus != kStatus_Success) {
                task->rx_error();
                break;
            }
            // do not process small transfers and SMBus reads
            if (!context->transmit && transfer->data != nullptr
                && transfer->transferredCount >= MinPacketSize) {
                // [0] = payload_size, [1] = 8 bit target address, [2:] payload
                context->buffer[0] = transfer->transferredCount + 1;
                context->buffer[1] = static_cast<uint8_t>(base->SAMR) | 0U;
                task->rx(context->buffer);
            }
            break;
        case kLPI2C_SlaveRepeatedStartEvent:
            // TODO the driver call AddressMatchEvent instead of RepeatedStartEvent. Is it a
            // BUG?
            break;
        default: nv::error("unknown event %d\n", transfer->event); break;
    }
}

void Driver::bind(nv::i2c::Port port, void* task)
{
    NV_ASSERT(task != nullptr);
    auto i2c_task = static_cast<nv::i2c::Task*>(task);
    nv::info("task %s binds to I2C port %d\n", i2c_task->name().data(), port);
    logger::info(logger::Event::I2CBind,
                 {static_cast<uint8_t>(i2c_task->id()), static_cast<uint8_t>(port)});
    _port                    = port;
    _base                    = get_base(port);
    _controller_context.task = task;
    _target_context.task     = task;
    _target_context.owner    = this;

    _peripheral_clk_hz = CLOCK_GetLPFlexCommClkFreq(LPI2C_GetInstance(_base));
    if (_peripheral_clk_hz == 0) {
        nv::error("fail to get clock frequency\n");
        _peripheral_clk_hz = 25000000UL;
    }
}

