NVIDIA/OpenSMA/src/sys/mcxn556/sys/i2c/i2c.cpp
void Driver::init()
{
    LPI2C_MasterTransferCreateHandle(
        _base, &_lpi2c_handle.controller, controller_callback, &_controller_context);
    if (nv::ipc::SlaveFunctionTableSize > 0) {
        LPI2C_SlaveTransferCreateHandle(
            _base, &_lpi2c_handle.target, target_callback_lookup, &_target_context);
    }
    else {
        LPI2C_SlaveTransferCreateHandle(
            _base, &_lpi2c_handle.target, target_callback, &_target_context);
    }

    LP_FLEXCOMM_SetIRQHandler(
        LPI2C_GetInstance(_base), irq_handler, &_lpi2c_handle, LP_FLEXCOMM_PERIPH_LPI2C);
}

void Driver::start(bool enable_target)
{
    LPI2C_MasterEnable(_base, true);
    if (enable_target) {
        LPI2C_SlaveEnable(_base, true);
        constexpr uint32_t Mask   = kLPI2C_SlaveAddressMatchEvent | kLPI2C_SlaveCompletionEvent;
        const status_t     Status = LPI2C_SlaveTransferNonBlocking(
            _base, &_lpi2c_handle.target, Mask);
        if (Status != kStatus_Success) {
            nv::error("fail to start target\n");
        }
    }
}

void Driver::peripheral_recovery(bool enable_target)
{
    auto& mutex = nv::ipc::Mutex::make(nv::i2c::port_to_mutex_id(_port));
    if (mutex.lock() != nv::ipc::Mutex::Status::Ok) {
        return;
    }

    constexpr uint8_t I2CRecoveryLogReport = 0;
    constexpr uint8_t I2CRecoveryLogResult = 1;
    nv::logger::info(
        nv::logger::Event::I2CSlaveRecovery,
        {I2CRecoveryLogReport,
         static_cast<uint8_t>(nv::common::to_underlying(_port) & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.isBusy ? 1 : 0),
         static_cast<uint8_t>(_lpi2c_handle.target.transferredCount & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.transfer.event & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.transfer.receivedAddress & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.transfer.completionStatus & 0xFFU)});

    // Abort current transfer and disable slave
    LPI2C_SlaveTransferAbort(_base, &_lpi2c_handle.target);
    LPI2C_SlaveEnable(_base, false);

    // Retrieve slave configuration from registers, reset, and re-init slave
    lpi2c_slave_config_t slave_config{};
    slave_config_fill_from_registers(_base, _peripheral_clk_hz, slave_config);
    LPI2C_SlaveInit(_base, &slave_config, _peripheral_clk_hz);

    // Enable slave and interrupts and arm for next transfer
    LPI2C_SlaveEnable(_base, true);
    constexpr uint32_t Mask = kLPI2C_SlaveAddressMatchEvent | kLPI2C_SlaveCompletionEvent;
    const status_t Status = LPI2C_SlaveTransferNonBlocking(_base, &_lpi2c_handle.target, Mask);
    nv::logger::info(
        nv::logger::Event::I2CSlaveRecovery,
        {I2CRecoveryLogResult,
         static_cast<uint8_t>(nv::common::to_underlying(_port) & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.isBusy ? 1 : 0),
         static_cast<uint8_t>(_lpi2c_handle.target.transferredCount & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.transfer.event & 0xFFU),
         static_cast<uint8_t>(_lpi2c_handle.target.transfer.receivedAddress & 0xFFU),
         static_cast<uint8_t>(static_cast<uint32_t>(Status) & 0xFFU),
         static_cast<uint8_t>(static_cast<uint32_t>(Status) >> 8U & 0xFFU)});

    mutex.unlock();
}

bool Driver::write(std::span<uint8_t> data)
{
    std::copy(data.begin(), data.end(), _controller_context.buffer.begin());
    lpi2c_master_transfer_t transfer = {
        .flags          = kLPI2C_TransferDefaultFlag,
        .slaveAddress   = static_cast<uint8_t>(_controller_context.buffer[0] >> 1U),
        .direction      = kLPI2C_Write,
        .subaddress     = 0,
        .subaddressSize = 0,
        .data           = &_controller_context.buffer.data()[1],
        .dataSize       = data.size() - 1,
    };

    auto& mutex = nv::ipc::Mutex::make(nv::i2c::port_to_mutex_id(_port));
    // Acquire mutex
    auto mutex_status = mutex.lock();
    if (mutex_status != nv::ipc::Mutex::Status::Ok) {
        return false;
    }
    const status_t Status = LPI2C_MasterTransferNonBlocking(
        _base, &_lpi2c_handle.controller, &transfer);
    mutex.unlock();
    return Status == kStatus_Success;
}

bool Driver::get_status(uint8_t address)
{
    constexpr size_t  PacketSize     = 11;
    constexpr uint8_t SmbusMctpCmd   = 0x0F;
    constexpr uint8_t MctpByteCount  = 0x08;
    constexpr uint8_t MctpHdrVersion = 0x01;
    constexpr uint8_t MctpNullEid    = 0x00;
    // SOM=1, EOM=1, pkt_seq=0, TO=1, msg_tag=0
    constexpr uint8_t MctpPktFlags    = 0xC8;
    constexpr uint8_t MctpMsgTypeCtrl = 0x00;
    // rq=1, d=0, instance_id=0
    constexpr uint8_t MctpCtrlRqByte = 0x80;
    constexpr uint8_t MctpCmdGetEpId = 0x02;
    constexpr uint8_t PecPlaceholder = 0x00;

    std::array<uint8_t, PacketSize> packet{SmbusMctpCmd,
                                           MctpByteCount,
                                           static_cast<uint8_t>(this->address() << 1U),
                                           MctpHdrVersion,
                                           MctpNullEid,
                                           MctpNullEid,
                                           MctpPktFlags,
                                           MctpMsgTypeCtrl,
                                           MctpCtrlRqByte,
                                           MctpCmdGetEpId,
                                           PecPlaceholder};

    std::array<uint8_t, PacketSize> pec_input{};
    pec_input[0] = static_cast<uint8_t>(address << 1U);
    std::copy(packet.begin(), packet.end() - 1, pec_input.begin() + 1);
    packet.back() = nv::i2c::crc8(pec_input);

    lpi2c_master_transfer_t transfer = {
        .flags          = kLPI2C_TransferDefaultFlag,
        .slaveAddress   = address,
        .direction      = kLPI2C_Write,
        .subaddress     = 0,
        .subaddressSize = 0,
        .data           = packet.data(),
        .dataSize       = packet.size(),
    };

    auto& mutex = nv::ipc::Mutex::make(nv::i2c::port_to_mutex_id(_port));
    if (mutex.lock() != nv::ipc::Mutex::Status::Ok) {
        return false;
    }
    const status_t Status = LPI2C_MasterTransferBlocking(_base, &transfer);
    mutex.unlock();
    return Status == kStatus_Success;
}

uint8_t Driver::address()
{
    return static_cast<uint8_t>(_base->SAMR) >> 1U;
}

void Driver::set_address(nv::i2c::Port port, uint8_t address, uint8_t sec_addr)
{
    auto base  = get_base(port);
    base->SAMR = LPI2C_SAMR_ADDR0(static_cast<uint32_t>(address))
               | LPI2C_SAMR_ADDR1(static_cast<uint32_t>(sec_addr));
    base->SCFGR1 &= ~LPI2C_SCFGR1_ADDRCFG_MASK;
    if (sec_addr != 0) {
        base->SCFGR1 |= LPI2C_SCFGR1_ADDRCFG(kLPI2C_MatchAddress0OrAddress1);
    }
    logger::info(logger::Event::I2CAddressUpdate,
                 {static_cast<uint8_t>(port), static_cast<uint8_t>(address)});
}

void Driver::set_master_duty_cycle(nv::i2c::Port port, uint8_t duty_cycle)
{
    constexpr uint32_t ClkLowShift  = 0;
    constexpr uint32_t ClkHighShift = 8;
    constexpr uint32_t ClkMask      = 0x3FU;

