NVIDIA/OpenSMA/src/sys/mcxn556/sys/i2c/i2c.cpp
    auto enabled = is_master_enabled(port);
    auto base    = get_base(port);
    auto mccr0   = base->MCCR0;

    uint32_t clkHi  = (mccr0 >> ClkHighShift) & ClkMask;
    uint32_t clkLo  = (mccr0 >> ClkLowShift) & ClkMask;
    uint32_t period = clkHi + clkLo;
    if (duty_cycle > 100 || period == 0) {
        return;
    }
    clkHi = static_cast<uint32_t>((static_cast<float>(period) * static_cast<float>(duty_cycle))
                                  / 100.0);
    clkLo = period - clkHi;

    logger::info(logger::Event::I2cClockPeriods,
                 {static_cast<uint8_t>(clkHi), static_cast<uint8_t>(clkLo)});
    mccr0 &= ~((ClkMask << ClkHighShift) | (ClkMask << ClkLowShift));
    mccr0 |= (clkHi << ClkHighShift) | (clkLo << ClkLowShift);

    if (enabled) {
        LPI2C_MasterEnable(base, false);
    }

    base->MCCR0 = mccr0;

    if (enabled) {
        LPI2C_MasterEnable(base, true);
    }
}

i2c::I2cStatus
Driver::i2c_read(uint8_t address, std::span<uint8_t> buffer, nv::i2c::I2cFlags flags)
{
    uint32_t lpi2c_flags = kLPI2C_TransferDefaultFlag;

    if (flags & nv::i2c::I2cFlags::RecvLen) {
        lpi2c_flags |= kLPI2C_TransferNoStartFlag;
    }

    if (flags & nv::i2c::I2cFlags::NoStop) {
        lpi2c_flags |= kLPI2C_TransferNoStopFlag;
    }

    lpi2c_master_transfer_t xfer{
        .flags        = lpi2c_flags,
        .slaveAddress = address,
        .direction    = kLPI2C_Read,
        .data         = buffer.data(),
        .dataSize     = (flags & nv::i2c::I2cFlags::QuickRead) ? 0 : buffer.size(),
    };

    const status_t status = LPI2C_MasterTransferNonBlocking(
        _base, &_lpi2c_handle.controller, &xfer);
    return sys::i2c::get_status(status);
}

i2c::I2cStatus
Driver::i2c_write(uint8_t address, std::span<uint8_t> buffer, nv::i2c::I2cFlags flags)
{
    lpi2c_master_transfer_t xfer{
        .flags        = (flags & nv::i2c::I2cFlags::NoStop) ? kLPI2C_TransferNoStopFlag
                                                            : kLPI2C_TransferDefaultFlag,
        .slaveAddress = address,
        .direction    = kLPI2C_Write,
        .data         = buffer.data(),
        .dataSize     = (flags & nv::i2c::I2cFlags::QuickWrite) ? 0 : buffer.size(),
    };

    const status_t status = LPI2C_MasterTransferNonBlocking(
        _base, &_lpi2c_handle.controller, &xfer);
    return sys::i2c::get_status(status);
}
